In [3]:
import pandas as pd
import numpy as np

# Create a dataframe from an array

## Option 1

In [6]:
# creating an array
data = np.array([[1,4], [2,5], [3,6]])

In [12]:
# creating a dataframe
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'], columns=['col1', 'col2'])

In [14]:
#showing a dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

## Option 2

In [15]:
# creating an array with list shape
data = [[1,4], [2,5], [3,6]]

In [17]:
# creating a dataframe
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'], columns=['col1', 'col2'])

In [18]:
#showing a dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# Creating a DataFrame from a dictionary

In [20]:
# lists used for this example
states = ['California', 'Texas', 'Florida', 'New York']
population = [39613493, 29730311, 21944577, 19299981]

In [22]:
# Storing lists within a dictionary
dict_states = {'States':states, 'Population':population}
dict_states

{'States': ['California', 'Texas', 'Florida', 'New York'],
 'Population': [39613493, 29730311, 21944577, 19299981]}

In [23]:
# Creating the dataframe
df_population = pd.DataFrame(dict_states)

In [24]:
# showing the dataframe
df_population

       States  Population
0  California    39613493
1       Texas    29730311
2     Florida    21944577
3    New York    19299981

# Creating a DataFrame from a csv file

In [25]:
# reading the csv file
df_exams = pd.read_csv('StudentsPerformance.csv')

In [26]:
# show first 5 rows of the dataFrame
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75